; domain
(define (domain depot)
(:requirements :typing :fluents)
(:types place locatable - object
  depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions
  (load_limit ?t - truck)
  (current_load ?t - truck)
  (weight ?c - crate)
  (fuel-cost)
)

(:action drive
:parameters (?x - truck ?y - place ?z - place)
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
    (increase (fuel-cost) 10)))

(:action lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x))
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action drop
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
    (on ?y ?z)))

(:action load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
    (<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
    (increase (current_load ?z) (weight ?y))))

(:action unload
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
    (decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob5656) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear pallet1)
	(at pallet2 distributor1)
	(clear crate2)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 295)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 268)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 89)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 62)
	(at crate2 distributor1)
	(on crate2 crate0)
	(= (weight crate2) 42)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet1)
		(on crate2 pallet2)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 3
2. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 42
   goals met: 0 of 3
3. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 3
4. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 42 to 131
   goals met: 0 of 3
5. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 131 to 89
   goals met: 0 of 3
6. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 3
7. (drop hoist2 crate2 pallet2 distributor1)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 pallet2)
   goals met: 1 of 3
8. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 3
9. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 22 to 23
   goals met: 1 of 3
10. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 89 to 151
   goals met: 1 of 3
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 3
12. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck0) from 151 to 89
   goals met: 1 of 3
13. (drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 pallet1)
   goals met: 2 of 3
14. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 89 to 0
   goals met: 2 of 3
15. (drop hoist1 crate0 crate1 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate1)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate1)
   goals met: 3 of 3
